tiborsimon/embedded-tdd-headers/pic/8bit/pic12lf1501_tdd.h
#define CLC1GLS1_D2N                  522
#define LC1G2D2N                      523
#define LC1G2D2T                      524
#define CLC1GLS1_D2T                  525
#define CLC1GLS1_D3N                  526
#define LC1G2D3N                      527
#define LC1G2D3T                      528
#define CLC1GLS1_D3T                  529
#define CLC1GLS1_D4N                  530
#define LC1G2D4N                      531
#define LC1G2D4T                      532
#define CLC1GLS1_D4T                  533
#define CLC1GLS2                      534
#define CLC1GLS2_D1N                  535
#define LC1G3D1N                      536
#define LC1G3D1T                      537
#define CLC1GLS2_D1T                  538
#define LC1G3D2N                      539
#define CLC1GLS2_D2N                  540
#define LC1G3D2T                      541
#define CLC1GLS2_D2T                  542
#define CLC1GLS2_D3N                  543
#define LC1G3D3N                      544
#define LC1G3D3T                      545
#define CLC1GLS2_D3T                  546
#define LC1G3D4N                      547
#define CLC1GLS2_D4N                  548
#define LC1G3D4T                      549
#define CLC1GLS2_D4T                  550
#define CLC1GLS3                      551
#define LC1G4D1N                      552
#define CLC1GLS3_G4D1N                553
#define LC1G4D1T                      554
#define CLC1GLS3_G4D1T                555
#define CLC1GLS3_G4D2N                556
#define LC1G4D2N                      557
#define CLC1GLS3_G4D2T                558
#define LC1G4D2T                      559
#define LC1G4D3N                      560
#define CLC1GLS3_G4D3N                561
#define LC1G4D3T                      562
#define CLC1GLS3_G4D3T                563
#define CLC1GLS3_G4D4N                564
#define LC1G4D4N                      565
#define CLC1GLS3_G4D4T                566
#define LC1G4D4T                      567
#define CLC2CON                       568
#define LC2MODE0                      569
#define LC2MODE                       570
#define CLC2CON_LCMODE0               571
#define LC2MODE1                      572
#define CLC2CON_LCMODE1               573
#define LC2MODE2                      574
#define CLC2CON_LCMODE2               575
#define LC2INTN                       576
#define CLC2CON_LCINTN                577
#define LC2INTP                       578
#define CLC2CON_LCINTP                579
#define CLC2CON_LCOUT                 580
#define LC2OUT                        581
#define LC2OE                         582
#define CLC2CON_LCOE                  583
#define CLC2CON_LCEN                  584
#define LC2EN                         585
#define CLC2POL                       586
#define LC2G1POL                      587
#define CLC2POL_G1POL                 588
#define LC2G2POL                      589
#define CLC2POL_G2POL                 590
#define LC2G3POL                      591
#define CLC2POL_G3POL                 592
#define LC2G4POL                      593
#define CLC2POL_G4POL                 594
#define CLC2POL_POL                   595
#define LC2POL                        596
#define CLC2SEL0                      597
#define LC2D1S0                       598
#define CLC2SEL0_D1S0                 599
#define LC2D1S                        600
#define LC2D1S1                       601
#define CLC2SEL0_D1S1                 602
#define LC2D1S2                       603
#define CLC2SEL0_D1S2                 604
#define LC2D2S0                       605
#define LC2D2S                        606
#define CLC2SEL0_D2S0                 607
#define LC2D2S1                       608
#define CLC2SEL0_D2S1                 609
#define LC2D2S2                       610
#define CLC2SEL0_D2S2                 611
#define CLC2SEL1                      612
#define CLC2SEL1_D3S0                 613
#define LC2D3S0                       614
#define LC2D3S                        615
#define LC2D3S1                       616
#define CLC2SEL1_D3S1                 617
#define LC2D3S2                       618
#define CLC2SEL1_D3S2                 619
#define LC2D4S                        620
#define LC2D4S0                       621
#define CLC2SEL1_D4S0                 622
#define LC2D4S1                       623
#define CLC2SEL1_D4S1                 624
#define LC2D4S2                       625
#define CLC2SEL1_D4S2                 626
#define CLC2GLS0                      627
#define LC2G1D1N                      628
#define CLC2GLS0_D1N                  629
#define CLC2GLS0_D1T                  630
#define LC2G1D1T                      631
#define LC2G1D2N                      632
#define CLC2GLS0_D2N                  633
#define CLC2GLS0_D2T                  634
#define LC2G1D2T                      635
#define LC2G1D3N                      636
#define CLC2GLS0_D3N                  637
#define CLC2GLS0_D3T                  638
#define LC2G1D3T                      639
#define LC2G1D4N                      640
#define CLC2GLS0_D4N                  641
#define CLC2GLS0_D4T                  642
#define LC2G1D4T                      643
#define CLC2GLS1                      644
#define CLC2GLS1_D1N                  645
#define LC2G2D1N                      646
#define CLC2GLS1_D1T                  647
#define LC2G2D1T                      648
#define CLC2GLS1_D2N                  649
#define LC2G2D2N                      650
#define CLC2GLS1_D2T                  651
#define LC2G2D2T                      652
#define LC2G2D3N                      653
#define CLC2GLS1_D3N                  654
#define LC2G2D3T                      655
#define CLC2GLS1_D3T                  656
#define LC2G2D4N                      657
#define CLC2GLS1_D4N                  658
#define LC2G2D4T                      659
#define CLC2GLS1_D4T                  660
#define CLC2GLS2                      661
#define LC2G3D1N                      662
#define CLC2GLS2_D1N                  663
#define CLC2GLS2_D1T                  664
#define LC2G3D1T                      665
#define CLC2GLS2_D2N                  666
#define LC2G3D2N                      667
#define LC2G3D2T                      668
#define CLC2GLS2_D2T                  669
#define CLC2GLS2_D3N                  670
#define LC2G3D3N                      671
#define CLC2GLS2_D3T                  672
#define LC2G3D3T                      673
#define CLC2GLS2_D4N                  674
#define LC2G3D4N                      675
#define LC2G3D4T                      676
#define CLC2GLS2_D4T                  677
#define CLC2GLS3                      678
#define LC2G4D1N                      679
#define CLC2GLS3_G4D1N                680
#define CLC2GLS3_G4D1T                681
#define LC2G4D1T                      682
#define CLC2GLS3_G4D2N                683
#define LC2G4D2N                      684
#define LC2G4D2T                      685
#define CLC2GLS3_G4D2T                686
#define CLC2GLS3_G4D3N                687
#define LC2G4D3N                      688
#define CLC2GLS3_G4D3T                689
#define LC2G4D3T                      690
#define LC2G4D4N                      691
#define CLC2GLS3_G4D4N                692
#define CLC2GLS3_G4D4T                693
#define LC2G4D4T                      694
#define BSR_ICDSHAD                   695
#define STATUS_SHAD                   696
#define C_SHAD                        697
#define DC_SHAD                       698
#define Z_SHAD                        699
#define WREG_SHAD                     700
#define BSR_SHAD                      701
#define PCLATH_SHAD                   702
#define FSR0L_SHAD                    703
#define FSR0H_SHAD                    704
#define FSR1L_SHAD                    705
#define FSR1H_SHAD                    706
#define STKPTR                        707
#define TOSL                          708
#define TOSH                          709

#endif // _PIC12LF1501_H_
